namespace GameSystems.Implementation.BattleSystem
{
    // ТЗ Боевая система:
    
    // BattleUnit - может перемещаться, атаковать, может быть убит, может атаковать здания
    // Имеет показатели: здоровье, урон, скорость, защита, дальность атаки
    
    // Игрок может производить юнитов в специальных зданиях (плюс есть здания где они могут размещаться)
    
    // Вражеские юниты могут разрушать здания игрока (их можно отстроить)
    
    // Башни - являются юнитом? - да, но особым
    
    //TODO: HealthComponent logic

    
    public interface IBattleUnit
    {
        
    }
}